app/controllers/articles_controller.rb

  def index
    if !params[:order_by].nil?
      @articles = Article.sorted_by(params[:order_by])
    elsif !params[:limit].nil?
      @articles = Article.only(params[:limit])
    else
      @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE "articles"."limit" = 3

  def show
    @article = Article.includes(:comments).find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" IN (1)

  def create
    # @article = Article.new(params[:article])
    @article = Article.new(:title => params[:article][:title],
                           :body => params[:article][:body])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "here is some text"], ["created_at", Mon, 05 Nov 2012 20:36:02 UTC +00:00], ["title", "First post"], ["updated_at", Mon, 05 Nov 2012 20:36:02 UTC +00:00]]

  def update
    # @article = Article.find(params[:id])
    respond_to do |format|
      if @article.update_attributes(params[:article])
---
UPDATE "articles" SET "body" = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.', "updated_at" = '2012-11-05 21:09:49.738943' WHERE "articles"."id" = 2

  def destroy
    # @article = Article.find(params[:id])
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]

  def load_article
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "2"]]