app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "11"]]
INSERT INTO "comments" ("article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 11], ["body", "happy word word word happy word word "], ["created_at", Tue, 13 Nov 2012 19:18:55 UTC +00:00], ["updated_at", Tue, 13 Nov 2012 19:18:55 UTC +00:00]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.build(params[:comment])

    respond_to do |format|
      if @comment.save